# Напишите ваше решение
a = int(input('введите возводимое в степень число', ))
b = int(input('введите степень', ))
result = (a ** b)
print(a, 'в степени', b, '=', result)
